package models;



// Model.
// Примените интерфейсы Income, Fiscal, переопределите их методы.
public class Product {

    // Объявление полей модели
    private String name;
    private int quantity;
    private double price;
    // Налоговоу ставку объявите в виде константы
    // здесь ...


    // Обеспечьте доступ к полям модели через getters и setters
    // здесь ...


    // Переопределите методы реализуемых интерфейсов.

    // Расчёт дохода от продаж, до уплаты налога.
    // здесь ...

    // Расчёт суммы налога с продаж.
    // здесь ...

    // Расчёт чистого дохода, после уплаты налога.
    // здесь ...
}
